import React from 'react';
import Marquee from 'react-fast-marquee';

const MarqueText = () => {
    return (
        <div className='bg-[#F3F3F3] flex gap-3 items-center w-10/12 mx-auto rounded-sm'>
           <p className='text-white bg-secondary px-3 p-4 rounded-sm'>Latest</p>
           <Marquee className='flex gap-3' pauseOnHover={true} speed={50}>
           <p>বাংলাদেশ ব্যাংকের নতুন মুদ্রানীতিতে মুদ্রাস্ফীতি নিয়ন্ত্রণের পদক্ষেপ
বাংলাদেশ ব্যাংক সর্বশেষ মুদ্রানীতি ঘোষণা করেছে, যার মূল লক্ষ্য হলো সাম্প্রতিক সময়ে দেশে ক্রমবর্ধমান মুদ্রাস্ফীতিকে নিয়ন্ত্রণে আনা। এই মুদ্রানীতিতে বাণিজ্যিক ব্যাংকের জন্য মূল সুদের হার ও রিজার্ভ চাহিদা পুনঃনির্ধারণ করা হয়েছে। নীতিনির্ধারকরা আশা করছেন, এই পরিবর্তনের ফলে বাজারে নগদ টাকার প্রবাহ কিছুটা কমে আসবে এবং মূল্যস্ফীতি নিয়ন্ত্রণে থাকবে। অর্থনীতিবিদরা বলছেন, এ ধরনের পদক্ষেপ দেশের অর্থনীতিতে স্বস্তি আনতে পারে, তবে এর কার্যকারিতা নির্ভর করবে বাস্তবায়নের ওপর। সাধারণ মানুষ এই পদক্ষেপের মাধ্যমে নিত্যপ্রয়োজনীয় পণ্যের দামে কিছুটা স্থিতিশীলতা প্রত্যাশা করছেন।

📍আরো খবর জানতে আমাদের সাথেই থাকুন।</p>
           </Marquee>
           
        </div>
    );
};

export default MarqueText;